"=====================================List==================================="
# списки это изменяемый  индексируемый упорядоченный итерируемый тип данных предназначенный для хранения любых данных в определенном порядке

list1 = [1, 2, 3, 'hello', True, False, [ 2, 3, 4, 5, 6], None]
print(list1) #list1 = [1, 2, 3, 'hello', True, False, [ 2, 3, 4, 5, 6], None]

print(list1[3]) #hello
print(list1[-1]) #None
print(list1[-2] [0]) # 2


list2 = list('hello') # ['h', 'e', 'l', 'l', 'o']
print(list2)
list3 = list(range(1, 51))
print(list3) # [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50]

"=======================================Методы списков========================"
# append() - добавляет элемент в конец списка

list2 = []
list3 = [1, 2, 3]
list2.append(True)
print(list2) # [True]
list3.append(None) # 1, 2, 3, None]
print(list3)

# pop() - удаляет элемент из списка по индексу и результатом метода будет удаленный элемент если не передать индекс - удалит с конца
list1 = [1, None, True, False, 3, 4, 5]
popped = list1.pop(1)
print(list1) # [1, True, False, 3, 4, 5]
print(popped) # None

# remove() - удаляет элемент из списка по значению
list1.remove(False)
print(list1) # [1, True, 3, 4, 5]

list3 = [1,1,1,1,1,1,1,1,1,2,2,2,2,2,2]
list3.remove(1)
print(list3)

# count() - считает колво принятого элемента в списке

list3 = [1,1,1,1,1,1,1,1,1,2,2,2,2,2,2]
print(list3.count(True)) # 9

# index() - возвращает индекс первого вхождения принятого элемента
list3 = [1,1,1,1,1,1,1,1,1,2,2,2,2,2,2]
print(list3.index(1)) # 0

# insert() - добавляет элемент в список по индексу
list4 = [[1,2,3,4], True, False, 'hello', '123']
list4.insert(0, 5)
print(list4) # 5, [1, 2, 3, 4], True, False, 'hello', '123']

# extend() - добавляет элементы принятого списка в первый список изменяя его
list1 = [1, 2, 3, 4, 5]
list2 = ['a', 'b', 'c', 'd', 'e']
list1.extend(list2)
print(list1)
print(list2)

# reverse() - изменяет список раставляя его элементы в обратном порядке
list2.reverse()
print(list2) 

# sort() - сортирует список сосотоящий из элементов из одного типа данных
list5 = [12, 33, 44, 533, 24, 535, 2323, 324, 4324, 2, 4, 0]
list5.sort()
print(list5) # [0, 2, 4, 12, 24, 33, 44, 324, 533, 535, 2323, 4324]
list5.sort(reverse=True) # если нужно отсортировать список по убыванию то можно в скобах указать reverse=True
print(list5)

# clear() - очищает список
# list5.clear()
# print(list5) # []


# len() - функция которая считает колво элементов в последовательности
print(len(list5))


# множественное присваивание
a, b, c = 12, 23, 123
print(a)
print(b)
print(c)

a, b = [1, 2]
print(a, b)
a, b = ['hello world'] # не достаточно элементов
print(a, b)
a, b = ['hello world', 2, 3, 4] # слишком много элементов
print(a, b)